let tableData = {};
let pokemon = [];
let star2 = 0;
let star3 = 0;
let star4 = 0;

window.onload = async () => {
    await getJSON();
    await onloadTable();
    await onloadSideBar();
    loadingComplete();
}

// TODO 改為讀取 excel
//fetch取得本地json
// tableData = [{"1":"1-利歐路","2":"2-火爆猴","3":"1-木守宮","4":"2-胖丁","5":"2-胖丁","6":"4-亞克諾姆","7":"1-大顎蟻","8":"2-尖牙陸鯊"},{"1":"2-尖牙陸鯊","2":"3-巨沼怪","3":"3-伊布","4":"3-巨沼怪","5":"2-力壯雞","6":"1-圓陸鯊","7":"1-圓陸鯊","8":"3-伊布"},{"1":"4-亞克諾姆","2":"1-大顎蟻","3":"1-幼基拉斯","4":"2-火爆猴","5":"2-吉利蛋","6":"3-美錄坦","7":"1-木守宮","8":"2-吉利蛋"},{"1":"1-火稚雞","2":"1-木守宮","3":"3-隆隆岩","4":"1-利歐路","5":"1-猴怪","6":"1-寶寶丁","7":"3-烈咬陸鯊","8":"2-火爆猴"},{"1":"2-火爆猴","2":"3-烈咬陸鯊","3":"2-沼躍魚","4":"2-多邊獸","5":"1-小拳石","6":"2-蔓藤怪","7":"2-森林蜥蜴","8":"1-小福蛋"},{"1":"2-力壯雞","2":"3-伊布","3":"5-拉帝歐斯","4":"1-水躍魚","5":"2-尖牙陸鯊","6":"3-巨金怪","7":"5-拉帝亞斯","8":"1-大顎蟻"},{"1":"1-木守宮","2":"3-班基拉斯","3":"2-路卡利歐","4":"2-蔓藤怪","5":"1-小福蛋","6":"3-沙漠蜻蜓","7":"1-火稚雞","8":"4-多邊獸Z"},{"1":"3-蜥蜴王","2":"2-多邊獸","3":"2-沼躍魚","4":"2-吉利蛋","5":"3-胖可丁","6":"1-火稚雞","7":"3-伊布","8":"1-圓陸鯊"},{"1":"1-小福蛋","2":"4-沙漠蜻蜓","3":"2-力壯雞","4":"3-隆隆岩","5":"3-美錄坦","6":"2-隆隆石","7":"2-隆隆石","8":"2-隆隆石"},{"1":"2-金屬怪","2":"2-超音波幼蟲","3":"4-艾姆利多","4":"2-沙基拉斯","5":"3-伊布","6":"1-小福蛋","7":"2-沼躍魚","8":"2-尖牙陸鯊"},{"1":"4-路卡利歐","2":"2-力壯雞","3":"1-寶寶丁","4":"2-路卡利歐","5":"1-火稚雞","6":"2-森林蜥蜴","7":"1-猴怪","8":"4-蜥蜴王"},{"1":"2-路卡利歐","2":"1-幼基拉斯","3":"3-美錄坦","4":"1-猴怪","5":"3-班基拉斯","6":"3-伊布","7":"3-巨金怪","8":"1-幼基拉斯"},{"1":"3-伊布","2":"3-巨蔓藤","3":"2-隆隆石","4":"4-蜥蜴王","5":"4-胖可丁","6":"1-小拳石","7":"1-利歐路","8":"2-路卡利歐"},{"1":"2-多邊獸","2":"4-美錄梅塔","3":"1-幼基拉斯","4":"1-小福蛋","5":"1-利歐路","6":"3-班基拉斯","7":"4-班基拉斯","8":"2-超音波幼蟲"},{"1":"1-寶寶丁","2":"1-小拳石","3":"1-圓陸鯊","4":"4-美錄梅塔","5":"2-多邊獸","6":"2-沙基拉斯","7":"3-胖可丁","8":"2-力壯雞"},{"1":"2-超音波幼蟲","2":"2-沼躍魚","3":"3-火爆猴","4":"3-火爆猴","5":"1-鐵啞鈴","6":"3-火焰雞","7":"1-水躍魚","8":"3-隆隆岩"},{"1":"2-蔓藤怪","2":"4-幸福蛋","3":"1-鐵啞鈴","4":"3-班基拉斯","5":"2-隆隆石","6":"2-森林蜥蜴","7":"2-胖丁","8":"1-火稚雞"},{"1":"4-火焰雞","2":"2-胖丁","3":"2-超音波幼蟲","4":"1-大顎蟻","5":"1-小拳石","6":"3-路卡利歐","7":"2-多邊獸","8":"2-多邊獸"},{"1":"1-猴怪","2":"3-胖可丁","3":"3-伊布","4":"3-巨蔓藤","5":"2-蔓藤怪","6":"2-蔓藤怪","7":"2-路卡利歐","8":"2-森林蜥蜴"},{"1":"3-幸福蛋","2":"2-吉利蛋","3":"1-小福蛋","4":"2-沼躍魚","5":"4-火焰雞","6":"1-水躍魚","7":"3-隆隆岩","8":"3-蜥蜴王"},{"1":"1-利歐路","2":"4-蒂安希","3":"1-水躍魚","4":"1-木守宮","5":"2-吉利蛋","6":"1-鐵啞鈴","7":"2-蔓藤怪","8":"4-隆隆岩"},{"1":"2-多邊獸","2":"1-利歐路","3":"3-多邊獸II","4":"2-力壯雞","5":"4-路卡利歐","6":"4-隆隆岩","7":"3-伊布","8":"3-巨蔓藤"},{"1":"3-巨蔓藤","2":"1-水躍魚","3":"2-多邊獸","4":"3-胖可丁","5":"3-火焰雞","6":"2-力壯雞","7":"1-寶寶丁","8":"2-金屬怪"},{"1":"1-火稚雞","2":"1-鐵啞鈴","3":"3-沙漠蜻蜓","4":"4-噴火龍","5":"2-超音波幼蟲","6":"2-超音波幼蟲","7":"1-寶寶丁","8":"3-幸福蛋"},{"1":"4-烈咬陸鯊","2":"1-圓陸鯊","3":"2-蔓藤怪","4":"1-寶寶丁","5":"4-蜥蜴王","6":"4-班基拉斯","7":"2-尖牙陸鯊","8":"3-伊布"},{"1":"1-鐵啞鈴","2":"2-蔓藤怪","3":"4-路卡利歐","4":"4-巨金怪","5":"1-幼基拉斯","6":"2-胖丁","7":"3-路卡利歐","8":"1-小拳石"},{"1":"3-美錄坦","2":"3-多邊獸II","3":"2-火爆猴","4":"3-幸福蛋","5":"2-力壯雞","6":"3-多邊獸II","7":"3-巨沼怪","8":"3-火爆猴"},{"1":"2-超音波幼蟲","2":"2-力壯雞","3":"2-吉利蛋","4":"1-幼基拉斯","5":"2-森林蜥蜴","6":"3-蜥蜴王","7":"4-噴火龍","8":"2-蔓藤怪"},{"1":"1-水躍魚","2":"4-噴火龍","3":"3-烈咬陸鯊","4":"3-伊布","5":"1-圓陸鯊","6":"2-吉利蛋","7":"1-幼基拉斯","8":"5-蒂安希"},{"1":"3-沙漠蜻蜓","2":"2-沙基拉斯","3":"1-利歐路","4":"4-巨金怪","5":"5-拉帝歐斯","6":"3-巨蔓藤","7":"4-由克希","8":"2-沼躍魚"},{"1":"4-多邊獸Z","2":"2-金屬怪","3":"3-路卡利歐","4":"2-尖牙陸鯊","5":"2-沙基拉斯","6":"5-固拉多","7":"3-沙漠蜻蜓","8":"1-鐵啞鈴"},{"1":"2-森林蜥蜴","2":"2-胖丁","3":"4-噴火龍","4":"2-金屬怪","5":"3-火爆猴","6":"4-巨蔓藤","7":"2-超音波幼蟲","8":"2-森林蜥蜴"},{"1":"2-路卡利歐","2":"3-蜥蜴王","3":"2-尖牙陸鯊","4":"1-鐵啞鈴","5":"4-巨沼怪","6":"2-胖丁","7":"5-壘磊石","8":"2-多邊獸"},{"1":"2-吉利蛋","2":"4-火焰雞","3":"2-胖丁","4":"5-砰頭小丑","5":"1-水躍魚","6":"2-沼躍魚","7":"2-吉利蛋","8":"1-猴怪"},{"1":"3-隆隆岩","2":"2-路卡利歐","3":"1-猴怪","4":"2-路卡利歐","5":"4-艾姆利多","6":"2-火爆猴","7":"1-小拳石","8":"4-烈咬陸鯊"},{"1":"1-大顎蟻","2":"3-伊布","3":"2-沙基拉斯","4":"1-鐵啞鈴","5":"3-路卡利歐","6":"2-金屬怪","7":"2-沙基拉斯","8":"3-巨金怪"},{"1":"5-原始蓋歐卡","2":"2-森林蜥蜴","3":"1-火稚雞","4":"2-隆隆石","5":"2-金屬怪","6":"4-噴火龍","7":"3-火焰雞","8":"1-水躍魚"},{"1":"1-小拳石","2":"1-小福蛋","3":"4-班基拉斯","4":"3-烈咬陸鯊","5":"3-烈咬陸鯊","6":"1-大顎蟻","7":"2-力壯雞","8":"4-噴火龍"},{"1":"3-巨沼怪","2":"2-蔓藤怪","3":"2-胖丁","4":"1-小拳石","5":"2-沼躍魚","6":"1-利歐路","7":"3-多邊獸II","8":"3-沙漠蜻蜓"},{"1":"1-幼基拉斯","2":"2-隆隆石","3":"1-大顎蟻","4":"1-火稚雞","5":"1-大顎蟻","6":"1-水躍魚","7":"2-火爆猴","8":"3-美錄坦"},{"1":"1-圓陸鯊","2":"1-寶寶丁","3":"3-蜥蜴王","4":"3-火焰雞","5":"2-路卡利歐","6":"3-伊布","7":"4-沙漠蜻蜓","8":"3-路卡利歐"},{"1":"4-胖可丁","2":"5-拉帝亞斯","3":"1-木守宮","4":"3-伊布","5":"1-木守宮","6":"4-巨金怪","7":"2-路卡利歐","8":"2-沙基拉斯"},{"1":"2-沼躍魚","2":"3-幸福蛋","3":"1-小拳石","4":"1-猴怪","5":"2-火爆猴","6":"1-木守宮","7":"1-圓陸鯊","8":"4-由克希"},{"1":"3-巨金怪","2":"1-火稚雞","3":"3-巨蔓藤","4":"1-圓陸鯊","5":"3-巨沼怪","6":"2-沙基拉斯","7":"2-火爆猴","8":"1-木守宮"},{"1":"2-沙基拉斯","2":"1-猴怪","3":"2-金屬怪","4":"2-超音波幼蟲","5":"4-噴火龍","6":"1-猴怪","7":"3-火爆猴","8":"1-利歐路"},{"1":"2-隆隆石","2":"1-小福蛋","3":"5-美錄梅塔","4":"4-烈咬陸鯊","5":"3-幸福蛋","6":"2-金屬怪","7":"1-鐵啞鈴","8":"2-超音波幼蟲"},{"1":"4-噴火龍","2":"2-金屬怪","3":"2-森林蜥蜴","4":"2-森林蜥蜴","5":"2-多邊獸","6":"1-幼基拉斯","7":"1-小福蛋","8":"1-大顎蟻"},{"1":"2-隆隆石","2":"4-巨沼怪","3":"2-沙基拉斯","4":"2-沼躍魚","5":"3-伊布","6":"3-胖可丁","7":"4-蒂安希","8":"1-寶寶丁"},{"1":"3-伊布","2":"2-尖牙陸鯊","3":"3-火焰雞","4":"3-多邊獸II","5":"2-尖牙陸鯊","6":"2-火爆猴","7":"2-胖丁","8":"4-幸福蛋"},{"1":"3-班基拉斯","2":"3-巨金怪","3":"4-巨沼怪","4":"2-吉利蛋","5":"1-寶寶丁","6":"2-尖牙陸鯊","7":"2-金屬怪","8":"2-隆隆石"}]
let getJSON = () => {
    tableData = [{"1":"2-斧牙龍","2":"2-大岩蛇","3":"4-爆岩龜獸","4":"4-火伊布","5":"2-卡咪龜","6":"3-皮卡丘","7":"1-尼多郎","8":"4-暴鯉龍"},{"1":"1-尼多郎","2":"2-尼多娜","3":"3-堅果啞鈴","4":"2-海魔獅","5":"4-雷公","6":"2-海魔獅","7":"3-暴風龍","8":"5-阿爾宙斯"},{"1":"2-尼多力諾","2":"4-雷公","3":"4-水箭龜","4":"2-大岩蛇","5":"3-雙斧戰龍","6":"1-海豹球","7":"5-達克萊伊","8":"3-雷伊布"},{"1":"2-堅果啞鈴","2":"1-尼多郎","3":"2-火恐龍","4":"1-牙牙","5":"2-甲殼龍","6":"2-皮卡丘","7":"3-大比鳥","8":"3-堅果啞鈴"},{"1":"1-寶貝龍","2":"2-甲殼龍","3":"1-小火龍","4":"1-海豹球","5":"2-皮卡丘","6":"1-小火龍","7":"1-尼多蘭","8":"4-尼多后"},{"1":"4-大綱蛇","2":"3-謎擬Q","3":"2-大岩蛇","4":"1-種子鐵球","5":"5-拉蒂歐斯","6":"1-種子鐵球","7":"3-火伊布","8":"2-尼多娜"},{"1":"3-堅果啞鈴","2":"2-伊布","3":"2-甲殼龍","4":"2-堅果啞鈴","5":"1-波波","6":"2-尼多力諾","7":"2-海魔獅","8":"2-卡咪龜"},{"1":"3-雙斧戰龍","2":"3-大比鳥","3":"2-伊布","4":"5-露奈雅拉","5":"2-比比鳥","6":"4-大比鳥","7":"3-尼多王","8":"4-皮卡丘"},{"1":"2-海魔獅","2":"1-尼多蘭","3":"1-波波","4":"1-尼多郎","5":"2-尼多力諾","6":"2-堅果啞鈴","7":"2-堅果啞鈴","8":"1-波波"},{"1":"2-皮卡丘","2":"1-種子鐵球","3":"2-卡咪龜","4":"4-水君","5":"1-小火龍","6":"2-妙蛙草","7":"2-甲殼龍","8":"3-尼多王"},{"1":"3-伊布","2":"1-妙蛙種子","3":"1-尼多蘭","4":"2-甲殼龍","5":"3-皮卡丘","6":"2-大岩蛇","7":"2-卡咪龜","8":"2-妙蛙草"},{"1":"1-海豹球","2":"3-暴飛龍","3":"5-阿爾宙斯","4":"3-暴飛龍","5":"3-噴火龍","6":"2-妙蛙草","7":"4-水箭龜","8":"3-雙斧戰龍"},{"1":"5-噴火龍","2":"5-四顎針龍","3":"2-斧牙龍","4":"3-雙斧戰龍","5":"3-大比鳥","6":"5-拉帝亞斯","7":"1-海豹球","8":"4-噴火龍"},{"1":"1-傑尼龜","2":"3-帝牙海獅","3":"3-尼多后","4":"2-伊布","5":"2-火恐龍","6":"4-大綱蛇","7":"3-爆焰龜獸","8":"1-尼多蘭"},{"1":"3-水伊布","2":"2-妙蛙草","3":"2-伊布","4":"3-噴火龍","5":"3-雷伊布","6":"1-尼多蘭","7":"2-伊布","8":"1-小火龍"},{"1":"2-大岩蛇","2":"4-妙蛙花","3":"1-波波","4":"2-妙蛙草","5":"2-卡咪龜","6":"1-小火龍","7":"2-尼多力諾","8":"3-伊布"},{"1":"1-小火龍","2":"2-斧牙龍","3":"3-水箭龜","4":"2-斧牙龍","5":"2-大岩蛇","6":"3-爆焰龜獸","7":"2-尼多娜","8":"3-暴鯉龍"},{"1":"3-雷伊布","2":"2-卡咪龜","3":"3-暴鯉龍","4":"2-尼多娜","5":"2-斧牙龍","6":"4-雷公","7":"1-波波","8":"2-伊布"},{"1":"2-比比鳥","2":"4-雙斧戰龍","3":"3-火伊布","4":"1-寶貝龍","5":"3-大綱蛇","6":"1-尼多蘭","7":"1-寶貝龍","8":"2-斧牙龍"},{"1":"1-牙牙","2":"2-海魔獅","3":"1-牙牙","4":"3-火伊布","5":"3-謎擬Q","6":"3-大比鳥","7":"2-大岩蛇","8":"1-尼多郎"},{"1":"2-火恐龍","2":"2-尼多娜","3":"2-尼多力諾","4":"2-皮卡丘","5":"2-火恐龍","6":"2-甲殼龍","7":"3-謎擬Q","8":"2-尼多娜"},{"1":"2-妙蛙草","2":"4-帝牙海獅","3":"2-甲殼龍","4":"1-妙蛙種子","5":"1-妙蛙種子","6":"1-尼多郎","7":"5-噴火龍","8":"2-比比鳥"},{"1":"4-炎帝","2":"4-水伊布","3":"1-寶貝龍","4":"1-波波","5":"2-尼多娜","6":"2-比比鳥","7":"4-雙斧戰龍","8":"2-尼多力諾"},{"1":"2-甲殼龍","2":"1-傑尼龜","3":"2-海魔獅","4":"2-大岩蛇","5":"3-水伊布","6":"1-傑尼龜","7":"1-波波","8":"2-大岩蛇"},{"1":"4-暴飛龍","2":"2-比比鳥","3":"2-尼多娜","4":"1-尼多蘭","5":"1-尼多娜","6":"3-帝牙海獅","7":"1-妙蛙種子","8":"2-甲殼龍"},{"1":"2-海魔獅","2":"3-尼多王","3":"1-傑尼龜","4":"4-大比鳥","5":"2-斧牙龍","6":"2-火恐龍","7":"4-炎帝","8":"2-火恐龍"},{"1":"2-妙蛙草","2":"1-牙牙","3":"2-皮卡丘","4":"2-尼多力諾","5":"4-暴飛龍","6":"2-伊布","7":"1-種子鐵球","8":"2-堅果啞鈴"},{"1":"2-伊布","2":"4-炎帝","3":"2-妙蛙草","4":"2-火恐龍","5":"1-寶貝龍","6":"2-斧牙龍","7":"2-皮卡丘","8":"1-寶貝龍"},{"1":"3-暴鯉龍","2":"3-尼多后","3":"4-炎帝","4":"2-卡咪龜","5":"1-海豹球","6":"2-皮卡丘","7":"1-牙牙","8":"3-皮卡丘"},{"1":"4-尼多后","2":"1-種子鐵球","3":"1-尼多郎","4":"3-水伊布","5":"1-牙牙","6":"2-堅果啞鈴","7":"1-傑尼龜","8":"2-妙蛙草"},{"1":"5-餓食大王","2":"2-比比鳥","3":"3-謎擬Q","4":"2-皮卡丘","5":"2-大岩蛇","6":"2-伊布","7":"3-水箭龜","8":"3-大綱蛇"},{"1":"1-尼多蘭","2":"3-爆焰龜獸","3":"2-比比鳥","4":"1-牙牙","5":"4-尼多王","6":"3-妙蛙花","7":"2-火恐龍","8":"4-雷伊布"},{"1":"1-傑尼龜","2":"4-皮卡丘","3":"1-種子鐵球","4":"3-暴鯉龍","5":"3-伊布","6":"2-尼多力諾","7":"4-皮卡丘","8":"5-超夢"},{"1":"1-牙牙","2":"3-雷伊布","3":"3-伊布","4":"4-噴火龍","5":"1-海豹球","6":"3-尼多后","7":"4-妙蛙花","8":"2-海魔獅"},{"1":"2-尼多娜","2":"1-寶貝龍","3":"4-尼多后","4":"5-甲賀忍蛙","5":"2-尼多力諾","6":"2-火恐龍","7":"2-尼多力諾","8":"1-種子鐵球"},{"1":"3-水箭龜","2":"1-海豹球","3":"4-暴鯉龍","4":"3-堅果啞鈴","5":"3-爆焰龜獸","6":"3-謎擬Q","7":"2-伊布","8":"4-雷公"},{"1":"2-卡咪龜","2":"2-皮卡丘","3":"2-火恐龍","4":"1-傑尼龜","5":"4-水君","6":"2-卡咪龜","7":"3-帝牙海獅","8":"2-火恐龍"},{"1":"4-雷伊布","2":"2-堅果啞鈴","3":"3-尼多王","4":"4-火伊布","5":"5-超夢","6":"1-妙蛙種子","7":"2-斧牙龍","8":"2-皮卡丘"},{"1":"4-水君","2":"1-波波","3":"2-尼多力諾","4":"3-謎擬Q","5":"2-堅果啞鈴","6":"1-波波","7":"2-比比鳥","8":"1-妙蛙種子"},{"1":"2-卡咪龜","2":"2-海魔獅","3":"2-斧牙龍","4":"2-尼多娜","5":"2-伊布","6":"3-水伊布","7":"4-水伊布","8":"1-海豹球"},{"1":"2-大岩蛇","2":"1-寶貝龍","3":"3-妙蛙草","4":"3-帝牙海獅","5":"2-海魔獅","6":"4-水箭龜","7":"1-小火龍","8":"1-牙牙"},{"1":"2-甲殼龍","2":"2-火恐龍","3":"5-索爾迦雷歐","4":"2-比比鳥","5":"4-雷伊布","6":"1-尼多郎","7":"2-火恐龍","8":"4-水君"},{"1":"3-皮卡丘","2":"5-基格爾德","3":"4-水伊布","4":"1-小火龍","5":"1-尼多蘭","6":"4-尼多王","7":"2-妙蛙草","8":"3-妙蛙花"},{"1":"3-大綱蛇","2":"2-皮卡丘","3":"1-妙蛙種子","4":"4-尼多王","5":"1-寶貝龍","6":"3-火伊布","7":"4-暴鯉龍","8":"2-比比鳥"},{"1":"1-種子鐵球","2":"1-小火龍","3":"2-比比鳥","4":"2-堅果啞鈴","5":"1-妙蛙種子","6":"2-尼多娜","7":"3-尼多后","8":"1-傑尼龜"},{"1":"4-噴火龍","2":"3-妙蛙花","3":"2-卡咪龜","4":"4-爆焰龜獸","5":"2-皮卡丘","6":"3-噴火龍","7":"2-甲殼龍","8":"3-水箭龜"},{"1":"2-堅果啞鈴","2":"2-尼多力諾","3":"2-堅果啞鈴","4":"2-妙蛙草","5":"2-海魔獅","6":"4-火伊布","7":"2-妙蛙草","8":"2-皮卡丘"},{"1":"1-妙蛙種子","2":"2-卡咪龜","3":"1-海豹球","4":"2-海魔獅","5":"2-妙蛙草","6":"2-比比鳥","7":"2-比比鳥","8":"1-傑尼龜"},{"1":"2-伊布","2":"2-斧牙龍","3":"3-暴飛龍","4":"2-卡咪龜","5":"4-帝牙海獅","6":"3-大綱蛇","7":"2-堅果啞鈴","8":"2-斧牙龍"},{"1":"2-尼多娜","2":"3-噴火龍","3":"4-妙蛙花","4":"2-甲殼龍","5":"1-種子鐵球","6":"5-甲賀忍蛙","7":"2-大綱蛇","8":"2-伊布"}];
}

function loadingComplete() {
    document.getElementById('loading').style.display = "none";
    eventListener();
}

function eventListener() {
    
    const inputs = document.querySelectorAll('.form-check-input');
    for (let i = 0; i < inputs.length; i++) {
        inputs[i].addEventListener("click", function() {
            var name = inputs[i].value
            if (pokemon.find(e => e == `${name}`) == undefined) {
                pokemon.push(name);
                starCount(name[0], 1);
            } else {
                pokemon.splice(pokemon.indexOf(name), 1);
                starCount(name[0], -1);
            }

            var fields = document.getElementsByClassName(name);
            for (let i = 0; i< fields.length; i++ )
            {
                fields[i].classList.toggle('pick');
            }
        });
    }
}

function starCount(starNum, num) {
    if (starNum == 4) {
        star4 += num;
        document.getElementById("star-4").innerHTML = star4;
    } else if (starNum == 3) {
        star3 += num;
        document.getElementById("star-3").innerHTML = star3;
    } else if (starNum == 2) {
        star2 += num;
        document.getElementById("star-2").innerHTML = star2;
    }
}

function onloadTable() {
    var table = document.getElementById("pokemonTable");
    var htmlData = '';
    var number = tableData.length;
    for(var i = 0; i < tableData.length; i++){
        var row = tableData[i];
        var keys = Object.keys(row)
        htmlData += `<tr><td> ${number} </td>`;
        for (var j = 0; j < keys.length; j++)
        {
            var arr = row[keys[j]].split("-");
            var star = arr[0];
            var name = row[keys[j]];
            htmlData += `<td class="${row[keys[j]]} star-${star}"> ${name} </td>`;
        }
        htmlData += `<td> ${number} </td></tr>`;
        number -= 1;
    }
    table.innerHTML = htmlData;
}

function onloadSideBar() {
    for (var n = 4;  n > 1; n--)
    {
        var arr = [];
        for(var i = 0; i < tableData.length; i++){
            var row = tableData[i];
            var keys = Object.keys(row)
            for (var j = 0; j < keys.length; j++)
            {
                var star = row[keys[j]][0];
                var name = row[keys[j]];
                if (star == n && arr.find(e => e == `${name}`) == undefined )
                {
                    createSideBarList(n, name);
                    arr.push(`${name}`);
                }
            }
        }
    }
}

function createSideBarList(id, name) {
    var ul = document.getElementById(`sidebar-star-${id}`);

    var li = document.createElement("li");
    li.className = "list-group-item";

    var input = document.createElement("input");
    input.className  = "form-check-input me-1";
    input.type = "checkbox";
    input.id = `checkbox-${name}`;
    input.value = `${name}`;
    li.appendChild(input);

    var label = document.createElement("label");
    label.innerHTML = `${name}`;
    label.className = "form-check-label stretched-link";
    label.htmlFor = `checkbox-${name}`;

    li.appendChild(label);

    ul.appendChild(li);
}